<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002, Spring 2025</span><br>
</center></b>
<br><br>
<i><center>
<span style="font-size: 20pt; line-height: 1.2;">Lecture 13: Big Data Examples</span>
</center></i>

# Lecture Material

- The lecture slides contain the lecture material, slides, etc.


- The Jupyter notebook is for running example code and sample applications.

# Environment Setup and Test

## ipython-sql Magic

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [3]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [4]:
%sql select * from db_book.student limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

## PyMySQL

In [ ]:
import pymysql

__Note to DFF:__ Explain some of the concepts below:
1. Cursors and cursorclass
2. Autocommit
3. Why we get an array back

In [ ]:
conn = pymysql.connect(
    host="localhost",
    user="root",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True)

In [ ]:
cur = conn.cursor()
res = cur.execute("select * from db_book.student limit 10")
res = cur.fetchall()

In [ ]:
res

## Pandas and SQLAlchemy

In [ ]:
import pandas

In [ ]:
import sqlalchemy

In [ ]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [ ]:
df = pandas.read_sql("select * from db_book.student limit 10", con=engine)

In [ ]:
df

# Classic Models OLAP

## I am Lazy

I have built a Classic Models OLAP schema several times.

Instead of spending the time to go an find my code that did this, the old notebooks, restoring database backups, etc, I just decided to see what ChatGPT could do.

And it did a pretty darn good job.

So, let's take a look.

## DDL

In [28]:
%%sql

drop schema if exists classic_models_olap_v2;

create schema classic_models_olap_v2;

use classic_models_olap_v2;


-- 1. Date Dimension
CREATE TABLE dim_date_time (
    date_id INT PRIMARY KEY AUTO_INCREMENT,
    order_date DATE,
    year INT,
    quarter INT,
    month INT,
    day INT,
    weekday_name VARCHAR(10)
);

-- 2. Product Type Dimension
CREATE TABLE dim_product_type (
    product_id VARCHAR(15) PRIMARY KEY,
    product_name VARCHAR(70),
    product_line VARCHAR(50),
    product_scale VARCHAR(10),
    product_vendor VARCHAR(50)
);

-- 3. Location Dimension (reduced to country, state, city)
CREATE TABLE dim_location (
    location_id INT PRIMARY KEY AUTO_INCREMENT,
    customer_id INT,
    country VARCHAR(50),
    state VARCHAR(50),
    city VARCHAR(50)
);

 * mysql+pymysql://root:***@localhost
9 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [29]:
%%sql

CREATE TABLE fact_sales (
    fact_id INT PRIMARY KEY AUTO_INCREMENT,
    order_id INT,
    product_id VARCHAR(15),
    date_id INT,
    location_id INT,
    quantity_ordered INT,
    price_each DECIMAL(10, 2),
    order_line_revenue DECIMAL(12, 2),

    FOREIGN KEY (product_id) REFERENCES dim_product_type(product_id),
    FOREIGN KEY (date_id) REFERENCES dim_date_time(date_id),
    FOREIGN KEY (location_id) REFERENCES dim_location(location_id)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

## ETL

In [7]:
%%sql

INSERT INTO dim_product (
    product_code, product_name, product_line, product_scale, 
    product_vendor, product_description, quantity_in_stock, 
    buy_price, msrp
)
SELECT DISTINCT
    productCode,
    productName,
    productLine,
    productScale,
    productVendor,
    productDescription,
    quantityInStock,
    buyPrice,
    MSRP
FROM classicModels.products;

 * mysql+pymysql://root:***@localhost
110 rows affected.

[]

In [8]:
%%sql

INSERT INTO dim_date (
    order_date, year, quarter, month, day, week, day_of_week
)
SELECT DISTINCT
    orderDate,
    YEAR(orderDate),
    QUARTER(orderDate),
    MONTH(orderDate),
    DAY(orderDate),
    WEEK(orderDate),
    DAYNAME(orderDate)
FROM classicModels.orders;

 * mysql+pymysql://root:***@localhost
265 rows affected.

[]

In [9]:
%%sql

INSERT INTO dim_location (
    office_code, city, state, country, territory
)
SELECT DISTINCT
    officeCode,
    city,
    state,
    country,
    territory
FROM classicmodels.offices;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[]

In [11]:
%%sql

INSERT INTO fact_sales (
    product_id, date_id, location_id, quantity_ordered, price_each, order_line_number
)
SELECT
    dp.product_id,
    dd.date_id,
    dl.location_id,
    od.quantityOrdered,
    od.priceEach,
    od.orderLineNumber
FROM classicmodels.orderdetails od
JOIN classicmodels.orders o ON od.orderNumber = o.orderNumber
JOIN classicmodels.customers c ON o.customerNumber = c.customerNumber
JOIN classicmodels.employees e ON c.salesRepEmployeeNumber = e.employeeNumber
JOIN classicmodels.offices ofc ON e.officeCode = ofc.officeCode
JOIN dim_product dp ON dp.product_code = od.productCode
JOIN dim_date dd ON dd.order_date = o.orderDate
JOIN dim_location dl ON dl.office_code = ofc.officeCode;

 * mysql+pymysql://root:***@localhost
2996 rows affected.

[]

## Some Views

In [12]:
%%sql

-- View 1: Monthly Revenue by Product
CREATE VIEW vw_monthly_revenue_by_product AS
SELECT 
    dp.product_name,
    dd.year,
    dd.month,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
JOIN dim_date dd ON fs.date_id = dd.date_id
GROUP BY dp.product_name, dd.year, dd.month;

-- View 2: Revenue by Location and Year
CREATE VIEW vw_revenue_by_location_year AS
SELECT 
    dl.country,
    dl.city,
    dd.year,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_location dl ON fs.location_id = dl.location_id
JOIN dim_date dd ON fs.date_id = dd.date_id
GROUP BY dl.country, dl.city, dd.year;

-- View 3: Top Selling Products (by Revenue)
CREATE VIEW vw_top_products_by_revenue AS
SELECT 
    dp.product_name,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
GROUP BY dp.product_name
ORDER BY total_revenue DESC;

-- View 4: Quarterly Revenue Trends
CREATE VIEW vw_quarterly_revenue_trends AS
SELECT 
    dd.year,
    dd.quarter,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_date dd ON fs.date_id = dd.date_id
GROUP BY dd.year, dd.quarter
ORDER BY dd.year, dd.quarter;

-- View 5: Product Performance by Region
CREATE VIEW vw_product_performance_by_region AS
SELECT 
    dp.product_line,
    dl.territory,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
JOIN dim_location dl ON fs.location_id = dl.location_id
GROUP BY dp.product_line, dl.territory;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Some Queries

In [14]:
%%sql

/*
    Revenue by product and territory.
*/

SELECT 
    dp.product_line,
    dl.territory,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
JOIN dim_location dl ON fs.location_id = dl.location_id
GROUP BY dp.product_line, dl.territory;

 * mysql+pymysql://root:***@localhost
28 rows affected.

[('Trucks and Buses', 'NA', Decimal('411823.04')),
 ('Vintage Cars', 'NA', Decimal('688995.95')),
 ('Classic Cars', 'NA', Decimal('1322606.40')),
 ('Motorcycles', 'NA', Decimal('470817.63')),
 ('Trains', 'NA', Decimal('59593.83')),
 ('Ships', 'NA', Decimal('226269.48')),
 ('Planes', 'NA', Decimal('299085.58')),
 ('Classic Cars', 'EMEA', Decimal('1980041.22')),
 ('Trucks and Buses', 'EMEA', Decimal('428160.87')),
 ('Vintage Cars', 'EMEA', Decimal('758812.74')),
 ('Trains', 'EMEA', Decimal('103858.81')),
 ('Ships', 'EMEA', Decimal('373412.01')),
 ('Motorcycles', 'EMEA', Decimal('429221.77')),
 ('Planes', 'EMEA', Decimal('447204.86')),
 ('Classic Cars', 'Japan', Decimal('165393.31')),
 ('Vintage Cars', 'Japan', Decimal('43272.62')),
 ('Trains', 'Japan', Decimal('15080.29')),
 ('Ships', 'Japan', Decimal('30505.70')),
 ('Trucks and Buses', 'Japan', Decimal('51160.60')),
 ('Motorcycles', 'Japan', Decimal('53828.99')),
 ('Planes', 'Japan', Decimal('97868.56')),
 ('Motorcycles', 'APAC', Decimal('167557.73')),
 ('Planes', 'APAC', Decimal('110478.54')),
 ('Vintage Cars', 'APAC', Decimal('306478.32')),
 ('Classic Cars', 'APAC', Decimal('385881.56')),
 ('Trucks and Buses', 'APAC', Decimal('132969.06')),
 ('Ships', 'APAC', Decimal('33811.15')),
 ('Trains', 'APAC', Decimal('9999.99'))]

In [17]:
%%sql

/*
    Drill down by country and territory.
*/
SELECT 
    dp.product_line,
    dl.territory,
    dl.country,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
JOIN dim_location dl ON fs.location_id = dl.location_id
GROUP BY dp.product_line, dl.territory, dl.country
ORDER BY dp.product_line, dl.territory, dl.country;

 * mysql+pymysql://root:***@localhost
35 rows affected.

[('Classic Cars', 'APAC', 'Australia', Decimal('385881.56')),
 ('Classic Cars', 'EMEA', 'France', Decimal('1335414.46')),
 ('Classic Cars', 'EMEA', 'UK', Decimal('644626.76')),
 ('Classic Cars', 'Japan', 'Japan', Decimal('165393.31')),
 ('Classic Cars', 'NA', 'USA', Decimal('1322606.40')),
 ('Motorcycles', 'APAC', 'Australia', Decimal('167557.73')),
 ('Motorcycles', 'EMEA', 'France', Decimal('287669.45')),
 ('Motorcycles', 'EMEA', 'UK', Decimal('141552.32')),
 ('Motorcycles', 'Japan', 'Japan', Decimal('53828.99')),
 ('Motorcycles', 'NA', 'USA', Decimal('470817.63')),
 ('Planes', 'APAC', 'Australia', Decimal('110478.54')),
 ('Planes', 'EMEA', 'France', Decimal('307551.29')),
 ('Planes', 'EMEA', 'UK', Decimal('139653.57')),
 ('Planes', 'Japan', 'Japan', Decimal('97868.56')),
 ('Planes', 'NA', 'USA', Decimal('299085.58')),
 ('Ships', 'APAC', 'Australia', Decimal('33811.15')),
 ('Ships', 'EMEA', 'France', Decimal('251463.11')),
 ('Ships', 'EMEA', 'UK', Decimal('121948.90')),
 ('Ships', 'Japan', 'Japan', Decimal('30505.70')),
 ('Ships', 'NA', 'USA', Decimal('226269.48')),
 ('Trains', 'APAC', 'Australia', Decimal('9999.99')),
 ('Trains', 'EMEA', 'France', Decimal('71488.95')),
 ('Trains', 'EMEA', 'UK', Decimal('32369.86')),
 ('Trains', 'Japan', 'Japan', Decimal('15080.29')),
 ('Trains', 'NA', 'USA', Decimal('59593.83')),
 ('Trucks and Buses', 'APAC', 'Australia', Decimal('132969.06')),
 ('Trucks and Buses', 'EMEA', 'France', Decimal('290439.46')),
 ('Trucks and Buses', 'EMEA', 'UK', Decimal('137721.41')),
 ('Trucks and Buses', 'Japan', 'Japan', Decimal('51160.60')),
 ('Trucks and Buses', 'NA', 'USA', Decimal('411823.04')),
 ('Vintage Cars', 'APAC', 'Australia', Decimal('306478.32')),
 ('Vintage Cars', 'EMEA', 'France', Decimal('539734.86')),
 ('Vintage Cars', 'EMEA', 'UK', Decimal('219077.88')),
 ('Vintage Cars', 'Japan', 'Japan', Decimal('43272.62')),
 ('Vintage Cars', 'NA', 'USA', Decimal('688995.95'))]

In [19]:
%%sql

/*
    Do a Pivot.

    This looks weird because the product line dimension is a bit messed up.
*/
SELECT
    dl.territory,
    dl.country,
    SUM(CASE WHEN dp.product_line = 'Classic Cars' THEN fs.revenue ELSE 0 END) AS classic_cars_revenue,
    SUM(CASE WHEN dp.product_line = 'Motorcycles' THEN fs.revenue ELSE 0 END) AS motorcycles_revenue,
    SUM(CASE WHEN dp.product_line = 'Planes' THEN fs.revenue ELSE 0 END) AS planes_revenue,
    SUM(CASE WHEN dp.product_line = 'Ships' THEN fs.revenue ELSE 0 END) AS ships_revenue,
    SUM(CASE WHEN dp.product_line = 'Trains' THEN fs.revenue ELSE 0 END) AS trains_revenue,
    SUM(CASE WHEN dp.product_line = 'Trucks and Buses' THEN fs.revenue ELSE 0 END) AS trucks_buses_revenue,
    SUM(CASE WHEN dp.product_line = 'Vintage Cars' THEN fs.revenue ELSE 0 END) AS vintage_cars_revenue
FROM fact_sales fs
JOIN dim_product dp ON fs.product_id = dp.product_id
JOIN dim_location dl ON fs.location_id = dl.location_id
GROUP BY dl.territory, dl.country
ORDER BY dl.territory, dl.country;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('APAC', 'Australia', Decimal('385881.56'), Decimal('167557.73'), Decimal('110478.54'), Decimal('33811.15'), Decimal('9999.99'), Decimal('132969.06'), Decimal('306478.32')),
 ('EMEA', 'France', Decimal('1335414.46'), Decimal('287669.45'), Decimal('307551.29'), Decimal('251463.11'), Decimal('71488.95'), Decimal('290439.46'), Decimal('539734.86')),
 ('EMEA', 'UK', Decimal('644626.76'), Decimal('141552.32'), Decimal('139653.57'), Decimal('121948.90'), Decimal('32369.86'), Decimal('137721.41'), Decimal('219077.88')),
 ('Japan', 'Japan', Decimal('165393.31'), Decimal('53828.99'), Decimal('97868.56'), Decimal('30505.70'), Decimal('15080.29'), Decimal('51160.60'), Decimal('43272.62')),
 ('NA', 'USA', Decimal('1322606.40'), Decimal('470817.63'), Decimal('299085.58'), Decimal('226269.48'), Decimal('59593.83'), Decimal('411823.04'), Decimal('688995.95'))]

In [21]:
%%sql

/*
    Revenue by year and quarter.
*/

SELECT
    dd.year,
    dd.quarter,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_date dd ON fs.date_id = dd.date_id
GROUP BY dd.year, dd.quarter
ORDER BY dd.year, dd.quarter;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(2003, 1, Decimal('405613.55')),
 (2003, 2, Decimal('515754.91')),
 (2003, 3, Decimal('616895.32')),
 (2003, 4, Decimal('1779084.61')),
 (2004, 1, Decimal('799579.31')),
 (2004, 2, Decimal('779271.81')),
 (2004, 3, Decimal('1028690.38')),
 (2004, 4, Decimal('1908364.01')),
 (2005, 1, Decimal('984641.15')),
 (2005, 2, Decimal('786295.56'))]

In [22]:
%%sql

/*
    Drill down by territory.
*/

SELECT
    dd.year,
    dd.quarter,
    dl.territory AS region,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_date dd ON fs.date_id = dd.date_id
JOIN dim_location dl ON fs.location_id = dl.location_id
GROUP BY dd.year, dd.quarter, dl.territory
ORDER BY dd.year, dd.quarter, dl.territory;

 * mysql+pymysql://root:***@localhost
39 rows affected.

[(2003, 1, 'EMEA', Decimal('263185.81')),
 (2003, 1, 'Japan', Decimal('51001.22')),
 (2003, 1, 'NA', Decimal('91426.52')),
 (2003, 2, 'APAC', Decimal('56309.11')),
 (2003, 2, 'EMEA', Decimal('278847.09')),
 (2003, 2, 'Japan', Decimal('44380.15')),
 (2003, 2, 'NA', Decimal('136218.56')),
 (2003, 3, 'APAC', Decimal('107467.01')),
 (2003, 3, 'EMEA', Decimal('160080.38')),
 (2003, 3, 'Japan', Decimal('38350.15')),
 (2003, 3, 'NA', Decimal('310997.78')),
 (2003, 4, 'APAC', Decimal('141172.99')),
 (2003, 4, 'EMEA', Decimal('817398.56')),
 (2003, 4, 'Japan', Decimal('133517.88')),
 (2003, 4, 'NA', Decimal('686995.18')),
 (2004, 1, 'APAC', Decimal('99039.28')),
 (2004, 1, 'EMEA', Decimal('432386.56')),
 (2004, 1, 'Japan', Decimal('47177.59')),
 (2004, 1, 'NA', Decimal('220975.88')),
 (2004, 2, 'APAC', Decimal('119211.66')),
 (2004, 2, 'EMEA', Decimal('297397.64')),
 (2004, 2, 'Japan', Decimal('37221.54')),
 (2004, 2, 'NA', Decimal('325440.97')),
 (2004, 3, 'APAC', Decimal('119041.91')),
 (2004, 3, 'EMEA', Decimal('499596.63')),
 (2004, 3, 'Japan', Decimal('2611.84')),
 (2004, 3, 'NA', Decimal('407440.00')),
 (2004, 4, 'APAC', Decimal('205703.17')),
 (2004, 4, 'EMEA', Decimal('941863.53')),
 (2004, 4, 'Japan', Decimal('64750.48')),
 (2004, 4, 'NA', Decimal('696046.83')),
 (2005, 1, 'APAC', Decimal('111957.93')),
 (2005, 1, 'EMEA', Decimal('480925.74')),
 (2005, 1, 'Japan', Decimal('37483.77')),
 (2005, 1, 'NA', Decimal('354273.71')),
 (2005, 2, 'APAC', Decimal('187273.29')),
 (2005, 2, 'EMEA', Decimal('349030.34')),
 (2005, 2, 'Japan', Decimal('615.45')),
 (2005, 2, 'NA', Decimal('249376.48'))]

In [24]:
%%sql

/*
    Drill down and slice.
*/

SELECT
    dd.year,
    dd.quarter,
    dl.country,
    dl.territory,
    SUM(fs.revenue) AS total_revenue
FROM fact_sales fs
JOIN dim_date dd ON fs.date_id = dd.date_id
JOIN dim_location dl ON fs.location_id = dl.location_id
WHERE dl.territory = 'EMEA'
GROUP BY dd.year, dd.quarter, dl.country, dl.territory
ORDER BY dd.year, dd.quarter, dl.country, dl.territory;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[(2003, 1, 'France', 'EMEA', Decimal('146317.22')),
 (2003, 1, 'UK', 'EMEA', Decimal('116868.59')),
 (2003, 2, 'France', 'EMEA', Decimal('249417.95')),
 (2003, 2, 'UK', 'EMEA', Decimal('29429.14')),
 (2003, 3, 'France', 'EMEA', Decimal('97640.48')),
 (2003, 3, 'UK', 'EMEA', Decimal('62439.90')),
 (2003, 4, 'France', 'EMEA', Decimal('476584.25')),
 (2003, 4, 'UK', 'EMEA', Decimal('340814.31')),
 (2004, 1, 'France', 'EMEA', Decimal('333721.17')),
 (2004, 1, 'UK', 'EMEA', Decimal('98665.39')),
 (2004, 2, 'France', 'EMEA', Decimal('207346.97')),
 (2004, 2, 'UK', 'EMEA', Decimal('90050.67')),
 (2004, 3, 'France', 'EMEA', Decimal('322977.86')),
 (2004, 3, 'UK', 'EMEA', Decimal('176618.77')),
 (2004, 4, 'France', 'EMEA', Decimal('601183.84')),
 (2004, 4, 'UK', 'EMEA', Decimal('340679.69')),
 (2005, 1, 'France', 'EMEA', Decimal('336800.44')),
 (2005, 1, 'UK', 'EMEA', Decimal('144125.30')),
 (2005, 2, 'France', 'EMEA', Decimal('311771.40')),
 (2005, 2, 'UK', 'EMEA', Decimal('37258.94'))]

Hmm, ... that does not look right.

That is because the location dimension is _the location of the sales representative's office_ not the location of the customer making the purchase. That would be another approach to location dimension.

In [25]:
%%sql

select * from dim_location;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, '1', 'San Francisco', 'CA', 'USA', 'NA'),
 (2, '2', 'Boston', 'MA', 'USA', 'NA'),
 (3, '3', 'NYC', 'NY', 'USA', 'NA'),
 (4, '4', 'Paris', None, 'France', 'EMEA'),
 (5, '5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan'),
 (6, '6', 'Sydney', None, 'Australia', 'APAC'),
 (7, '7', 'London', None, 'UK', 'EMEA')]

In [26]:
%%sql

select * from classicmodels.offices;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('1', 'San Francisco', '+1 650 219 4782', '100 Market Street', 'Suite 300', 'CA', 'USA', '94080', 'NA'),
 ('2', 'Boston', '+1 215 837 0825', '1550 Court Place', 'Suite 102', 'MA', 'USA', '02107', 'NA'),
 ('3', 'NYC', '+1 212 555 3000', '523 East 53rd Street', 'apt. 5A', 'NY', 'USA', '10022', 'NA'),
 ('4', 'Paris', '+33 14 723 4404', "43 Rue Jouffroy D'abbans", None, None, 'France', '75017', 'EMEA'),
 ('5', 'Tokyo', '+81 33 224 5000', '4-1 Kioicho', None, 'Chiyoda-Ku', 'Japan', '102-8578', 'Japan'),
 ('6', 'Sydney', '+61 2 9264 2451', '5-11 Wentworth Avenue', 'Floor #2', None, 'Australia', 'NSW 2010', 'APAC'),
 ('7', 'London', '+44 20 7877 2041', '25 Old Broad Street', 'Level 7', None, 'UK', 'EC2N 1HN', 'EMEA')]